export const BF_VALUE_HINT_TEXT = 'Если бизнес-функция не актуальна, можно её пропустить ' +
    'или явно указать, что не используется. При переключении заполненные значения ниже не удаляются, ' +
    'а остаются в качестве черновика. Если заполнены какие-то данные и не выбрано значение ' +
    '"Используется", то БФ и заполненные данные будут проигнорированы при формировании отчёта'

export const BF_FTR_HINT_TEXT = 'Под функционально-техническими требованиями подразумевается ' +
    'перечисление основных функциональных возможностей программного ' +
    'обеспечения/системы (возможно указание условий, особенностей, ' +
    'ограничений и т.п., связанных с конкретикой реализации), выполнение ' +
    'которых необходимо для реализации соответствующей бизнес-функции или ' +
    'группы бизнес-функций'

export const BF_PRIORITY_HINT_TEXT = 'Приоритет – это интегральная оценка степени важности и срочности ' +
    'реализации конкретных функционально-технических требований в ' +
    'российском программном обеспечении, обеспечивающем реализацию данной ' +
    'бизнес-функции или группы функций, и которое предполагается использовать ' +
    'для замещения зарубежных программных продуктов, а также потенциал ' +
    'тиражирования решения. При выставлении приоритета должны учитываться ' +
    'риски (прежде всего, связанные с остановкой или неэффективной реализации ' +
    'производственных и/или управленческих процессов) и степень влияния этих ' +
    'рисков на предприятия отрасли, в случае реализации этих рисков\n\n' +
    'Возможные значения:\n' +
    '\t* 1 - Высокий приоритет импортозамещения\n' +
    '\t* 2 - Средний приоритет импортозамещения\n' +
    '\t* 3 - Низкий приоритет импортозамещения'

export const BF_REASON_HINT_TEXT = 'Здесь необходимо максимально четко сформулировать причину ' +
    'указания соответствующего уровня приоритета. Например, дать оценку ' +
    'количества предприятий, которые могут быть затронуты проблемами, ' +
    'связанными с нереализацией соответствующего решения, дать информацию о ' +
    'продукции, которая не сможет быть выпущена, если возможно, дать ' +
    'финансовую оценку рисков, задержки в сроках реализации производственных ' +
    'программ и т.д.'

export const BF_RU_SOFT_AVAIL_STATUS_HINT_TEXT = 'Для соответствующей функционально-технологической области ' +
    'дается оценка функциональных возможностей ' +
    'практического использования российских продуктов в продуктивной среде для ' +
    'реализации заявленных функционально-технологических требований, необходимых для данной бизнес-функции, ' +
    'т.е. насколько совокупность российских решений, которые ' +
    'на практике можно использовать по отдельности или совместно в реальной ' +
    'производственной (продуктивной) среде покрывает функционал ведущих ' +
    'зарубежных решений, в контексте применения в рамах данной бизнес функции.'

export const BF_SOFT_USAGE_STATUS_HINT_TEXT = 'Нужно определить используется БФ с программным обеспечением ' +
    '(любого производства) или выполняется без него (например, всё заполняется в бумажном виде). ' +
    'Если среди используемого ПО есть хотя бы один продукт не включённый в реестр российского ПО ' +
    '(в том числе собственной разработки), то указывается, что используется с иностранным ПО. В обратном случае, ' +
    'если всё используемое ПО внесено в реестр, отмечается использование с российским ПО'

export const BF_SOFT_HINT_TEXT = 'Указывается список ПО, которое используется для реализации данной БФ'

export const BF_COMMENTS_HINT_TEXT = 'Если ИТ-решения не полностью закрывают ' +
    'или закрывают только часть функционально-технологической области, ' +
    'необходимо указать какой функционал остаётся незакрытым'

export const BF_TARGET_SOFTWARE_HINT_TEXT = 'Программное обеспечение (из реестра российского ПО), ' +
    'которое по вашему мнению закрывает все требования в максимальном объёме. Если такое ПО уже используется и ' +
    'выбрано в пункте выше, то продублируйте его здесь'
